{
  "backend/main.mo": "Motoko canister defining user profiles, mantra data, chant sessions, streaks, and access-controlled query methods with comparison utilities for sorting.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components with confidence and test references.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the purpose of various frontend source files, hooks, and components.",
  "frontend/index.css": "Tailwind CSS base and theme variable definitions for light and dark modes with custom color tokens.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling theme, navigation, authentication gate, cloud sync, and layout rendering.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication wrapper that manages login state, profile fetching, and conditional rendering of profile setup or protected content.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication flow and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new users to enter a display name and saving the profile via backend mutation.",
  "frontend/src/components/chant/AudioControls.tsx": "UI card for selecting background audio tracks, toggling playback, and adjusting volume.",
  "frontend/src/components/chant/MalaCounter.tsx": "Displays mala bead progress, triggering vibration and a completion banner every 108 counts.",
  "frontend/src/components/chant/TargetProgress.tsx": "Shows progress toward a chant target with a progress bar and completion state.",
  "frontend/src/components/chant/VoiceControls.tsx": "Handles voice-based chanting recognition with start/stop controls and manual incrementing.",
  "frontend/src/components/dashboard/HistoryList.tsx": "Groups and displays chanting history by date with counts per mantra.",
  "frontend/src/components/dashboard/ProgressGraph.tsx": "Renders daily, weekly, or monthly aggregated chant counts as a simple bar graph.",
  "frontend/src/components/dashboard/StreakCard.tsx": "Displays the user's current chanting streak and last active date.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation header showing app branding, page navigation, and login state.",
  "frontend/src/components/layout/BottomNav.tsx": "Mobile bottom navigation for switching between chant, dashboard, and settings pages.",
  "frontend/src/components/system/OfflineBanner.tsx": "Alerts the user when offline and notes that progress will sync later.",
  "frontend/src/components/system/ReminderBanner.tsx": "Shows a dismissible reminder message with a bell icon.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useAppState.ts": "Manages persistent app state including mantra selection, audio settings, sessions, and daily totals, with helpers to update and merge session data.",
  "frontend/src/hooks/useAudioPlayer.ts": "Controls looping audio playback with track switching, volume changes, and play/pause/toggle functions.",
  "frontend/src/hooks/useCloudSync.ts": "Syncs local chant sessions and daily totals with the cloud when logged in, and merges remote sessions into local state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and logout.",
  "frontend/src/hooks/useMantraCounting.ts": "Counts occurrences of a mantra in speech transcripts, tracking matches and supporting manual increments and reset.",
  "frontend/src/hooks/useOfflineStatus.ts": "Tracks online/offline status and periodically checks backend reachability via the actor.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, mantras, sessions, streaks, and daily totals via the backend actor.",
  "frontend/src/hooks/useReminders.ts": "Manages user-configurable morning and evening reminders with notification support and persistence.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom React hook wrapping browser speech recognition to capture transcripts, track listening state, and handle errors.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme with localStorage persistence and a toggle function.",
  "frontend/src/index.css": "Tailwind base stylesheet defining light and dark CSS variables for app theming.",
  "frontend/src/lib/aggregation.ts": "Utilities to aggregate daily, weekly, and monthly chant data and compute streaks.",
  "frontend/src/lib/mantras.ts": "Exports a list of supported mantras with names, descriptions, and languages.",
  "frontend/src/lib/storage.ts": "Helpers for loading, saving, and removing JSON data in localStorage with error handling.",
  "frontend/src/lib/textNormalize.ts": "Normalizes text by lowercasing, removing punctuation, and collapsing whitespace.",
  "frontend/src/lib/vibration.ts": "Provides vibration helpers for success and mala completion haptic feedback.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity before rendering the app.",
  "frontend/src/pages/ChantPage.tsx": "Chanting session page handling counting, audio, voice input, and saving sessions.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing streaks, progress graphs, and chant history with offline awareness.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page for mantra selection, targets, themes, reminders, and audio preferences.",
  "frontend/src/utils/urlParams.ts": "Utility helpers to get, store, retrieve, and clear URL or session-based parameters, including hash-query parsing and persistence handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, layout, animations, and typography, with plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the NaamJap Voice app, its features, architecture notes, and versioned state information."
}